{
    "!": 0,
    "!!": 1443,
    "!!!": 11194,
    "!!!!": 4003,
    "!!!!!!!!": 11281,
    "!!!!!!!!!!!!!!!!": 30146,
    "!!!!!!!!!!!</w>": 49339,
    "!!!!!!!!!!</w>": 35579,
    "!!!!!!!!!</w>": 28560,
    "!!!!!!!!</w>": 21622,
    "!!!!!!!</w>": 15203,
    "!!!!!!</w>": 9168,
    "!!!!!</w>": 5203,
    "!!!!</w>": 2360,
    "!!!\"</w>": 28048,
    "!!!)</w>": 42532,
    "!!!</w>": 995,
    "!!\"</w>": 20556,
    "!!#</w>": 34997,
    "!!)</w>": 28352,
    "!!</w>": 748,
    "!!@</w>": 40705,
    "!\"</w>": 2947,
    "!\"@</w>": 43819,
    "!#</w>": 9670,
    "!'</w>": 13222,
    "!),</w>": 37904,
    "!).</w>": 26225,
    "!)</w>": 4571,
    "!*</w>": 37737,
    "!,</w>": 29325,
    "!-</w>": 43499,
    "!...</w>": 22121,
    "!..</w>": 35475,
    "!.</w>": 22517,
    "!:)</w>": 31671,
    "!:</w>": 17545,
    "!</w>": 256,
    "!?!</w>": 29767,
    "!?!?</w>": 47081,
    "!?</w>": 6004,
    "!@</w>": 15117,
    "!]</w>": 34466,
    "!âĢ¦</w>": 35068,
    "!âĿ¤ï¸ı</w>": 32559,
    "!ðŁİī</w>": 49085,
    "!ðŁĺĬ</w>": 43434,
    "!ðŁĺį</w>": 36438,
    "\"": 1,
    "\"!</w>": 10377,
    "\"\"": 41530,
    "\"\"\"</w>": 25539,
    "\"\"</w>": 8575,
    "\"#</w>": 8345,
    "\"'</w>": 31065,
    "\"(</w>": 32741,
    "\")</w>": 13112,
    "\",</w>": 4332,
    "\"-</w>": 9375,
    "\"....</w>": 37785,
    "\"...</w>": 9049,
    "\"..</w>": 25403,
    "\".</w>": 2811,
    "\"/</w>": 39486,
    "\":</w>": 7811,
    "\";</w>": 37549,
    "\"</w>": 257,
    "\"?</w>": 11727,
    "\"@</w>": 1512,
    "\"@_</w>": 20236,
    "\"[</w>": 36930,
    "\"âĢ¦</w>": 33993,
    "\"âĢĶ</w>": 41151,
    "#": 2,
    "##</w>": 15483,
    "#...</w>": 31491,
    "#:</w>": 30144,
    "#</w>": 258,
    "#@</w>": 35062,
    "#âĢ¦</w>": 12834,
    "#âĢİ</w>": 34262,
    "$": 3,
    "$$": 24233,
    "$$$</w>": 31859,
    "$$</w>": 14929,
    "$)</w>": 39460,
    "$.</w>": 34682,
    "$</w>": 259,
    "%": 4,
    "%!</w>": 35070,
    "%),</w>": 37819,
    "%)</w>": 16063,
    "%,</w>": 14505,
    "%-</w>": 48784,
    "%.</w>": 12475,
    "%;</w>": 33379,
    "%</w>": 260,
    "&": 5,
    "&&</w>": 27791,
    "&</w>": 261,
    "'": 6,
    "'!</w>": 13781,
    "'\"</w>": 19479,
    "'#</w>": 15319,
    "''": 46594,
    "''</w>": 8445,
    "')</w>": 19175,
    "',</w>": 5662,
    "'-</w>": 26152,
    "'...</w>": 20474,
    "'.</w>": 4645,
    "':</w>": 7182,
    "';</w>": 44517,
    "'</w>": 262,
    "'?</w>": 17242,
    "'@</w>": 26397,
    "'d</w>": 1896,
    "'ll</w>": 1342,
    "'m</w>": 880,
    "'re</w>": 982,
    "'s</w>": 568,
    "'t</w>": 713,
    "'ve</w>": 1200,
    "'âĢ¦</w>": 42120,
    "(": 7,
    "(!)</w>": 30253,
    "(\"</w>": 18741,
    "(#</w>": 6229,
    "($)</w>": 46597,
    "($</w>": 15186,
    "(&</w>": 15042,
    "('</w>": 18235,
    "((": 22944,
    "(((</w>": 33287,
    "((</w>": 13796,
    "().</w>": 41737,
    "()</w>": 8475,
    "(*": 48004,
    "(*</w>": 39575,
    "(+</w>": 12903,
    "(-</w>": 20228,
    "(...</w>": 45159,
    "(.</w>": 43055,
    "(:</w>": 8528,
    "(;</w>": 23983,
    "(</w>": 263,
    "(?)</w>": 22885,
    "(@</w>": 2181,
    "(Â£</w>": 33987,
    "(Â©</w>": 44886,
    "(ðŁĵ·:</w>": 34610,
    "(ðŁĵ·</w>": 37999,
    "(ðŁĵ¸:</w>": 44422,
    "(ðŁĵ¸</w>": 45204,
    ")": 8,
    ")!!</w>": 47518,
    ")!</w>": 7805,
    ")\"</w>": 13046,
    ")#</w>": 39981,
    ")'</w>": 23613,
    ")(</w>": 27956,
    "))": 13720,
    "))))": 42911,
    "))))</w>": 34181,
    ")))</w>": 18305,
    "))</w>": 5167,
    "),</w>": 2361,
    ")-</w>": 19034,
    ")...</w>": 15274,
    ")..</w>": 41822,
    ").</w>": 1818,
    ")/</w>": 26616,
    "):</w>": 4143,
    ");</w>": 19686,
    ")</w>": 264,
    ")?</w>": 18765,
    ")@</w>": 41928,
    ")_/": 45028,
    ")_/Â¯</w>": 45781,
    ")âĢ¦</w>": 41844,
    "*": 9,
    "*)</w>": 30956,
    "**": 9825,
    "****": 21326,
    "********": 42974,
    "*****</w>": 43571,
    "****</w>": 25167,
    "***</w>": 7829,
    "**</w>": 4441,
    "*,</w>": 41895,
    "*-*</w>": 23568,
    "*.</w>": 31304,
    "*</w>": 265,
    "*_*</w>": 44535,
    "+": 10,
    "+)</w>": 34810,
    "++": 47298,
    "+++</w>": 35986,
    "++</w>": 19056,
    "+,</w>": 35885,
    "+.</w>": 25238,
    "+/-</w>": 47614,
    "+</w>": 266,
    ",": 11,
    ",\"</w>": 3823,
    ",#</w>": 11215,
    ",&</w>": 26905,
    ",'</w>": 10599,
    ",)</w>": 44493,
    ",,": 21340,
    ",,,,</w>": 33225,
    ",,,</w>": 14811,
    ",,</w>": 8844,
    ",-</w>": 29821,
    ",...</w>": 20365,
    ",.</w>": 41277,
    ",</w>": 267,
    ",@</w>": 13975,
    ",âĢ¦</w>": 14601,
    "-": 12,
    "-\"</w>": 18646,
    "-#</w>": 10151,
    "-$</w>": 24946,
    "-'</w>": 28010,
    "-(</w>": 33345,
    "-)</w>": 3535,
    "-*</w>": 21527,
    "--": 2154,
    "----": 5753,
    "--------": 11772,
    "----------------": 23122,
    "----</w>": 30164,
    "----></w>": 35999,
    "---</w>": 11079,
    "---></w>": 14518,
    "--</w>": 2432,
    "--></w>": 6422,
    "-->></w>": 47252,
    "-.-</w>": 32765,
    "-...</w>": 43147,
    "-.</w>": 44040,
    "-</w>": 268,
    "-></w>": 5081,
    "-@</w>": 10087,
    "-_-</w>": 27227,
    "-__": 42718,
    "-âĢ¦</w>": 30047,
    ".": 13,
    ".!!</w>": 37805,
    ".!</w>": 14030,
    ".\"": 18650,
    ".\"-</w>": 21234,
    ".\"</w>": 1081,
    ".\"âĢĶ</w>": 48703,
    ".#</w>": 5014,
    ".'\"</w>": 41558,
    ".''</w>": 49379,
    ".'</w>": 5938,
    ".(</w>": 22294,
    ".)</w>": 5376,
    ".*</w>": 26145,
    ".,</w>": 5276,
    ".-</w>": 12481,
    "..": 608,
    "..!!</w>": 23707,
    "..!</w>": 17994,
    "..\"</w>": 15229,
    "..#</w>": 15735,
    "..,</w>": 47143,
    "...": 3002,
    "...!!!</w>": 38351,
    "...!!</w>": 39915,
    "...!</w>": 16860,
    "...\"</w>": 5240,
    "...#</w>": 8195,
    "...&</w>": 44979,
    "...'</w>": 23167,
    "...(</w>": 37981,
    "...)</w>": 14040,
    "...,</w>": 42717,
    "....": 2386,
    "....\"</w>": 26689,
    "....#</w>": 20346,
    ".....": 34151,
    ".....#</w>": 38867,
    "........": 8246,
    "................": 24855,
    "............</w>": 42965,
    "...........</w>": 35008,
    "..........</w>": 25526,
    ".........</w>": 19881,
    "........</w>": 14720,
    ".......</w>": 9917,
    "......</w>": 5590,
    ".....</w>": 3104,
    "....</w>": 1390,
    "....@</w>": 29790,
    "...:</w>": 34570,
    "...</w>": 678,
    "...?</w>": 16388,
    "...@</w>": 12672,
    "..</w>": 852,
    "..?</w>": 23875,
    "..@</w>": 21124,
    "./</w>": 31975,
    ".:</w>": 15811,
    ".;</w>": 47596,
    ".</w>": 269,
    ".<</w>": 29442,
    ".?</w>": 29294,
    ".@</w>": 1230,
    ".]</w>": 33511,
    ".~</w>": 42651,
    ".âĢ¦</w>": 18047,
    ".âĿ¤ï¸ı</w>": 39085,
    ".âłĢ</w>": 30097,
    ".ðŁĺĤ</w>": 46580,
    "/": 14,
    "/#</w>": 13217,
    "/$</w>": 36266,
    "/-</w>": 19811,
    "/.</w>": 39382,
    "//": 15348,
    "////": 46271,
    "///</w>": 22734,
    "//</w>": 3502,
    "/</w>": 270,
    "/@</w>": 8216,
    "0": 15,
    "0</w>": 271,
    "1": 16,
    "1</w>": 272,
    "2": 17,
    "2</w>": 273,
    "3": 18,
    "3</w>": 274,
    "4": 19,
    "4</w>": 275,
    "5": 20,
    "5</w>": 276,
    "6": 21,
    "6</w>": 277,
    "7": 22,
    "7</w>": 278,
    "8": 23,
    "8</w>": 279,
    "9": 24,
    "9</w>": 280,
    ":": 25,
    ":\"": 29498,
    ":\")</w>": 46432,
    ":\"</w>": 12089,
    ":#</w>": 26625,
    ":$</w>": 33769,
    ":'": 8017,
    ":'(</w>": 21250,
    ":')</w>": 10701,
    ":'</w>": 23851,
    ":((</w>": 42496,
    ":(</w>": 5965,
    ":)": 11070,
    ":))))</w>": 42339,
    ":)))</w>": 21840,
    ":))</w>": 10164,
    ":).</w>": 39010,
    ":)</w>": 1408,
    ":*</w>": 12617,
    ":-": 13021,
    ":-(</w>": 25137,
    ":-)</w>": 4223,
    ":-</w>": 10323,
    ":...</w>": 42140,
    "://</w>": 12441,
    ":/</w>": 13604,
    "::": 33077,
    ":::</w>": 43818,
    "::</w>": 9788,
    ":</w>": 281,
    ":></w>": 39677,
    ":@</w>": 14339,
    ":]</w>": 43486,
    ":|</w>": 45986,
    ":âĢ¦</w>": 22365,
    ";": 26,
    ";))</w>": 41873,
    ";)</w>": 3661,
    ";-": 35657,
    ";-)</w>": 10475,
    ";;": 34824,
    ";;</w>": 24492,
    ";</w>": 282,
    "<": 27,
    "<-</w>": 47280,
    "</</w>": 34308,
    "<<": 24588,
    "<</w>": 283,
    "<<</w>": 16482,
    "<<<</w>": 35054,
    "<|endoftext|>": 49407,
    "<|startoftext|>": 49406,
    "=": 28,
    "=))</w>": 39587,
    "=)</w>": 17840,
    "=</w>": 284,
    "==": 11748,
    "====": 21734,
    "========": 38952,
    "==></w>": 29688,
    "=></w>": 9714,
    ">": 29,
    ">.<</w>": 38507,
    ">:</w>": 36196,
    "></w>": 285,
    "><</w>": 28015,
    ">>": 8270,
    ">></w>": 2988,
    ">>></w>": 6395,
    ">>>>": 18461,
    ">>>></w>": 18435,
    ">>>>></w>": 32972,
    ">>>>>></w>": 48947,
    ">>>>>>>>": 41947,
    ">_": 44144,
    "?": 30,
    "?!": 9785,
    "?!!</w>": 25342,
    "?!\"</w>": 29315,
    "?!</w>": 2835,
    "?!?!</w>": 16349,
    "?!?!?!</w>": 49084,
    "?!?!?</w>": 37619,
    "?!?</w>": 11395,
    "?\"</w>": 3283,
    "?#</w>": 24018,
    "?'</w>": 13610,
    "?)</w>": 9626,
    "?,</w>": 41628,
    "?...</w>": 22641,
    "?..</w>": 43905,
    "?.</w>": 41251,
    "?:</w>": 21067,
    "?</w>": 286,
    "??": 5195,
    "??!!</w>": 43219,
    "??!</w>": 37341,
    "??\"</w>": 44996,
    "??</w>": 2197,
    "???": 40017,
    "???</w>": 3824,
    "????": 15936,
    "????</w>": 10362,
    "?????</w>": 21370,
    "??????</w>": 34589,
    "????????": 45091,
    "?@</w>": 29258,
    "?ðŁ¤Ķ</w>": 47928,
    "@": 31,
    "@#</w>": 39397,
    "@.</w>": 43730,
    "@/</w>": 28639,
    "@</w>": 287,
    "@@</w>": 30314,
    "@_</w>": 2692,
    "@__</w>": 17042,
    "@___</w>": 48308,
    "A": 32,
    "A</w>": 288,
    "B": 33,
    "B</w>": 289,
    "C": 34,
    "C</w>": 290,
    "D": 35,
    "D</w>": 291,
    "E": 36,
    "E</w>": 292,
    "F": 37,
    "F</w>": 293,
    "G": 38,
    "G</w>": 294,
    "H": 39,
    "H</w>": 295,
    "I": 40,
    "I</w>": 296,
    "J": 41,
    "J</w>": 297,
    "K": 42,
    "K</w>": 298,
    "L": 43,
    "L</w>": 299,
    "M": 44,
    "M</w>": 300,
    "N": 45,
    "N</w>": 301,
    "O": 46,
    "O</w>": 302,
    "P": 47,
    "P</w>": 303,
    "Q": 48,
    "Q</w>": 304,
    "R": 49,
    "R</w>": 305,
    "S": 50,
    "S</w>": 306,
    "T": 51,
    "T</w>": 307,
    "U": 52,
    "U</w>": 308,
    "V": 53,
    "V</w>": 309,
    "W": 54,
    "W</w>": 310,
    "X": 55,
    "X</w>": 311,
    "Y": 56,
    "Y</w>": 312,
    "Z": 57,
    "Z</w>": 313,
    "[": 58,
    "[#</w>": 11115,
    "[...": 39975,
    "[...]</w>": 43790,
    "[</w>": 314,
    "[@</w>": 15148,
    "[]</w>": 22240,
    "\\": 59,
    "\\'</w>": 41239,
    "\\</w>": 315,
    "]": 60,
    "]\"</w>": 39434,
    "],</w>": 34067,
    "].</w>": 26262,
    "]:</w>": 21641,
    "]</w>": 316,
    "][#</w>": 39009,
    "][</w>": 29329,
    "^": 61,
    "^)</w>": 30720,
    "^-": 43516,
    "^.": 31552,
    "^.^</w>": 35791,
    "^</w>": 317,
    "^^": 34454,
    "^^</w>": 9064,
    "^_": 14423,
    "^_^</w>": 15995,
    "_": 62,
    "_'</w>": 44701,
    "_(</w>": 36951,
    "_)</w>": 37393,
    "_*</w>": 36237,
    "_,</w>": 31417,
    "_-</w>": 23193,
    "_.</w>": 26841,
    "_/": 37647,
    "_:</w>": 13109,
    "_</w>": 318,
    "__": 2355,
    "__:</w>": 47043,
    "__</w>": 3838,
    "___": 43812,
    "___</w>": 13530,
    "____": 4727,
    "____</w>": 25350,
    "_____</w>": 38803,
    "________": 9549,
    "________________": 20115,
    "`": 63,
    "`</w>": 319,
    "a": 64,
    "a</w>": 320,
    "aa": 1821,
    "aa</w>": 3894,
    "aaa": 14376,
    "aaa</w>": 9583,
    "aaaa": 6727,
    "aaaa</w>": 19336,
    "aaaaa</w>": 31095,
    "aaaaaa</w>": 44413,
    "aaaaaaaa": 23126,
    "aaaah</w>": 49151,
    "aaah</w>": 35856,
    "aaay</w>": 37846,
    "aab</w>": 34108,
    "aac": 23251,
    "aac</w>": 11346,
    "aad": 20464,
    "aad</w>": 35894,
    "aaf": 37638,
    "aaf</w>": 31534,
    "aag": 42174,
    "aah</w>": 28990,
    "aaj": 28727,
    "aaj</w>": 43411,
    "aak": 37739,
    "aal": 22268,
    "aal</w>": 30208,
    "aali": 27896,
    "aaliyah</w>": 46577,
    "aam": 12943,
    "aam</w>": 22775,
    "aama": 45018,
    "aamaadmi": 45563,
    "aamaadmiparty</w>": 46406,
    "aamir</w>": 27456,
    "aan": 20705,
    "aan</w>": 13426,
    "aand": 38054,
    "aap": 12023,
    "aap</w>": 12052,
    "aapl</w>": 34516,
    "aar": 4695,
    "aar</w>": 13234,
    "aard": 46932,
    "aaron": 13948,
    "aaron</w>": 7709,
    "aas": 28542,
    "aas</w>": 32205,
    "aat": 34018,
    "aat</w>": 35004,
    "aau</w>": 35426,
    "aay": 38281,
    "aay</w>": 40249,
    "aaz</w>": 26770,
    "ab": 596,
    "ab</w>": 3937,
    "aba": 44204,
    "aba</w>": 11102,
    "abad": 33444,
    "abad</w>": 7155,
    "aban": 41662,
    "aband": 8595,
    "abandon</w>": 28805,
    "abandoned</w>": 11227,
    "abar": 17860,
    "abar</w>": 39805,
    "abas": 25402,
    "abay</w>": 43542,
    "abb": 38954,
    "abb</w>": 38297,
    "abba</w>": 30870,
    "abbas": 37494,
    "abbas</w>": 24412,
    "abbey": 31927,
    "abbey</w>": 10132,
    "abbie</w>": 39949,
    "abbo": 13536,
    "abbot</w>": 44046,
    "abbott": 43737,
    "abbott</w>": 15649,
    "abbrevi": 44843,
    "abby": 30586,
    "abby</w>": 14694,
    "abc": 13137,
    "abc</w>": 5334,
    "abcnews</w>": 31566,
    "abd</w>": 44093,
    "abdel": 46511,
    "abdomin": 35335,
    "abdominal</w>": 39328,
    "abdu": 13361,
    "abduc": 17884,
    "abducted</w>": 31520,
    "abduction</w>": 36984,
    "abdul": 14227,
    "abdul</w>": 15593,
    "abdullah</w>": 21317,
    "abe": 15856,
    "abe</w>": 12734,
    "abee</w>": 36037,
    "abel": 31938,
    "abel</w>": 25318,
    "abella</w>": 46156,
    "aben": 40865,
    "aber": 7828,
    "aber</w>": 41867,
    "aberdeen": 30539,
    "aberdeen</w>": 17236,
    "abh": 27484,
    "abh</w>": 33649,
    "abhcosmetics</w>": 49189,
    "abhi": 18113,
    "abhin": 44045,
    "abhishek</w>": 44502,
    "abi": 16867,
    "abi</w>": 14161,
    "abia</w>": 48604,
    "abide</w>": 49163,
    "abig": 20863,
    "abigail</w>": 25686,
    "abil": 21135,
    "abilities</w>": 8724,
    "ability": 35146,
    "ability</w>": 3024,
    "abit</w>": 48668,
    "ablanc": 33716,
    "able": 10102,
    "able</w>": 863,
    "abled</w>": 10655,
    "ableg</w>": 24055,
    "ables</w>": 8486,
    "ableton</w>": 47169,
    "ably</w>": 6748,
    "abnormal</w>": 40934,
    "abo": 2889,
    "abo</w>": 21861,
    "aboard</w>": 11661,
    "abol": 31768,
    "abolic</w>": 46827,
    "abolish</w>": 47403,
    "aboo</w>": 42433,
    "abor": 8416,
    "aboriginal</w>": 20422,
    "abortion</w>": 12336,
    "abortions</w>": 43218,
    "aboss</w>": 46401,
    "abou": 36455,
    "abou</w>": 44053,
    "abound</w>": 41037,
    "abour</w>": 46637,
    "about": 20204,
    "about</w>": 781,
    "abouts</w>": 36339,
    "above": 35019,
    "above</w>": 4348,
    "aboy</w>": 37077,
    "abpoli</w>": 44779,
    "abq</w>": 38767,
    "abr": 44932,
    "abra": 10694,
    "abra</w>": 35087,
    "abraham": 40623,
    "abraham</w>": 15869,
    "abram": 33255,
    "abrams</w>": 29852,
    "abre": 22472,
    "abre</w>": 46756,
    "abri": 28605,
    "abridged</w>": 45333,
    "abroad</w>": 11253,
    "abru": 46295,
    "abs": 18431,
    "abs</w>": 11109,
    "absc": 25389,
    "abscbn": 44260,
    "abscbn</w>": 45810,
    "absen": 32453,
    "absence</w>": 19240,
    "absent</w>": 30363,
    "absol": 4624,
    "absolu": 7055,
    "absolut": 4666,
    "absolute</w>": 7501,
    "absolutely</w>": 4703,
    "absor": 14303,
    "absorb</w>": 35806,
    "absorbed</w>": 45059,
    "absorbing</w>": 46412,
    "absorption</w>": 42210,
    "abstr": 7530,
    "abstract": 23885,
    "abstract</w>": 10197,
    "abstractart</w>": 31170,
    "abstraction</w>": 47696,
    "abstracts</w>": 40065,
    "absur": 21639,
    "absurd</w>": 29757,
    "abt</w>": 9850,
    "abu": 9167,
    "abu</w>": 11787,
    "abud": 20180,
    "abudha": 21450,
    "abudhabi</w>": 25256,
    "abuja</w>": 23371,
    "abun": 20544,
    "abundance</w>": 23236,
    "abundant</w>": 31611,
    "abur": 23377,
    "aburger</w>": 46660,
    "abuse</w>": 7678,
    "abused</w>": 23855,
    "abuses</w>": 37132,
    "abusing</w>": 36558,
    "abusive</w>": 26858,
    "abv</w>": 34172,
    "aby": 16342,
    "aby</w>": 31378,
    "abyss</w>": 33632,
    "abz</w>": 42292,
    "ac": 546,
    "ac</w>": 2816,
    "aca</w>": 9213,
    "acab": 41388,
    "acacia</w>": 44047,
    "acad</w>": 32537,
    "acade": 2892,
    "academia</w>": 22662,
    "academic": 31178,
    "academic</w>": 7935,
    "academics</w>": 26417,
    "academies</w>": 42569,
    "academy": 29968,
    "academy</w>": 4041,
    "acadi": 41455,
    "acadia</w>": 49236,
    "acam": 26172,
    "acan": 42227,
    "acan</w>": 26318,
    "acap": 32357,
    "acar": 22232,
    "acare</w>": 16961,
    "acc": 26805,
    "acc</w>": 9318,
    "acca</w>": 30883,
    "acce": 8564,
    "acceler": 10161,
    "accelerate</w>": 23619,
    "accelerated</w>": 38513,
    "accelerating</w>": 41821,
    "acceleration</w>": 39387,
    "accelerator</w>": 25261,
    "accent": 28110,
    "accent</w>": 18931,
    "accents</w>": 31738,
    "accenture</w>": 41853,
    "accep": 4616,
    "accept": 16447,
    "accept</w>": 9338,
    "acceptable</w>": 14209,
    "acceptance</w>": 17090,
    "accepted</w>": 9159,
    "accepting</w>": 12855,
    "accepts</w>": 22338,
    "access": 7596,
    "access</w>": 3822,
    "accessi": 10787,
    "accessibility</w>": 23407,
    "accessible</w>": 13977,
    "accessing</w>": 46339,
    "accessories</w>": 10220,
    "accessory</w>": 20417,
    "acci": 4263,
    "acci</w>": 33943,
    "accident</w>": 6608,
    "accidental</w>": 24895,
    "accidentally</w>": 11061,
    "accidents</w>": 22072,
    "acclaimed</w>": 21172,
    "acco</w>": 44730,
    "accol": 33858,
    "accolades</w>": 46731,
    "accom": 23658,
    "accommo": 34495,
    "accommod": 14386,
    "accommodate</w>": 34708,
    "accommodation</w>": 18066,
    "accommodations</w>": 45536,
    "accomp": 24985,
    "accompan": 14746,
    "accompanied</w>": 20715,
    "accompany</w>": 34142,
    "accompanying</w>": 38179,
    "accompli": 10205,
    "accomplish</w>": 25542,
    "accomplished</w>": 16462,
    "accomplishment</w>": 26100,
    "accomplishments</w>": 24965,
    "accor": 4182,
    "accord": 34293,
    "accord</w>": 28513,
    "according</w>": 4717,
    "accordingly</w>": 35535,
    "accordion</w>": 48760,
    "accoun": 3081,
    "account": 18424,
    "account</w>": 4684,
    "accountability</w>": 19377,
    "accountable</w>": 24216,
    "accountant</w>": 31026,
    "accountants</w>": 37222,
    "accounted</w>": 43951,
    "accounting</w>": 14805,
    "accounts</w>": 9974,
    "accra</w>": 31900,
    "accred": 17451,
    "accreditation</w>": 27015,
    "accredited</w>": 27647,
    "acct</w>": 45569,
    "accu": 5618,
    "accumul": 19275,
    "accumulation</w>": 37112,
    "accur": 6551,
    "accuracy</w>": 18423,
    "accurate</w>": 8858,
    "accurately</w>": 24206,
    "accusations</w>": 33615,
    "accuse</w>": 39414,
    "accused</w>": 9434,
    "accuses</w>": 27496,
    "accusing</w>": 41474,
    "acdc</w>": 45067,
    "ace": 2675,
    "ace</w>": 804,
    "acea</w>": 35219,
    "aceae</w>": 38153,
    "acele": 40868,
    "aceous</w>": 33610,
    "acer": 37990,
    "acer</w>": 25809,
    "aces</w>": 5725,
    "acet": 28735,
    "acf</w>": 38389,
    "ach": 972,
    "ach</w>": 987,
    "acha</w>": 22686,
    "acharya</w>": 45780,
    "achat</w>": 32706,
    "ache": 27771,
    "ache</w>": 7214,
    "ached</w>": 17048,
    "acher": 38442,
    "acher</w>": 17936,
    "achers</w>": 25051,
    "aches</w>": 14823,
    "achi": 3264,
    "achi</w>": 9087,
    "achiev": 8160,
    "achieve": 14798,
    "achieve</w>": 8175,
    "achieved</w>": 12359,
    "achievement</w>": 8245,
    "achievements</w>": 16114,
    "achiever</w>": 46286,
    "achievers</w>": 44544,
    "achieves</w>": 40123,
    "achieving</w>": 16120,
    "achilles</w>": 33327,
    "achim</w>": 42335,
    "aching</w>": 12864,
    "acho</w>": 33130,
    "achs</w>": 41195,
    "aci": 4359,
    "aci</w>": 34100,
    "acia</w>": 30163,
    "acial</w>": 32422,
    "acid": 35474,
    "acid</w>": 10085,
    "acidity</w>": 48800,
    "acids</w>": 27751,
    "acies</w>": 20162,
    "acin": 39442,
    "acing</w>": 9442,
    "acio</w>": 26202,
    "acion": 44965,
    "acion</w>": 24968,
    "acional</w>": 26435,
    "aciones</w>": 35832,
    "acious</w>": 16020,
    "acity</w>": 7511,
    "aciÃ³n</w>": 38175,
    "ack": 877,
    "ack</w>": 725,
    "acked</w>": 5698,
    "acker": 31201,
    "acker</w>": 7940,
    "ackeray</w>": 41843,
    "acki</w>": 42857,
    "acking</w>": 5515,
    "ackles</w>": 28503,
    "acknow": 13563,
    "acknowle": 18100,
    "acknowledge</w>": 25209,
    "acknowledged</w>": 35913,
    "acknowledges</w>": 49083,
    "acknowledging</w>": 45645,
    "acks</w>": 3858,
    "acl": 47593,
    "acl</w>": 23073,
    "acle</w>": 6504,
    "acles</w>": 34164,
    "aclu</w>": 37354,
    "acm</w>": 39317,
    "acmilan</w>": 36500,
    "acne</w>": 24195,
    "aco": 9463,
    "aco</w>": 8800,
    "acol": 17431,
    "acollege</w>": 43468,
    "acom": 17224,
    "acom</w>": 22342,
    "acon": 11621,
    "acon</w>": 11571,
    "aconf</w>": 38851,
    "acons</w>": 31599,
    "acor": 22076,
    "acorn</w>": 37537,
    "acos</w>": 39943,
    "acosta</w>": 31994,
    "acou": 8794,
    "acoun": 31295,
    "acounty</w>": 45449,
    "acoustic</w>": 10616,
    "acoustics</w>": 43873,
    "acp</w>": 19627,
    "acqu": 7946,
    "acquainted</w>": 40713,
    "acqui": 12194,
    "acquire</w>": 21576,
    "acquired</w>": 15932,
    "acquires</w>": 27376,
    "acquiring</w>": 42785,
    "acquis": 14207,
    "acquisition</w>": 16543,
    "acquisitions</w>": 39649,
    "acr</w>": 43648,
    "acre": 26749,
    "acre</w>": 9493,
    "acres</w>": 11630,
    "acro": 21060,
    "acrob": 40891,
    "acron": 37770,
    "across</w>": 2500,
    "acrosse</w>": 40979,
    "acruz</w>": 40455,
    "acry": 10440,
    "acrylic</w>": 12252,
    "acs</w>": 11782,
    "act": 10305,
    "act</w>": 1393,
    "acted</w>": 10971,
    "acti": 4786,
    "acting</w>": 6319,
    "action": 12493,
    "action</w>": 1816,
    "actions</w>": 6271,
    "activ": 3430,
    "activate</w>": 26737,
    "activated</w>": 22249,
    "activation</w>": 26769,
    "active": 19009,
    "active</w>": 4046,
    "actively</w>": 18645,
    "activi": 7230,
    "activism</w>": 20117,
    "activist</w>": 10850,
    "activists</w>": 12649,
    "activities</w>": 6514,
    "activity</w>": 6206,
    "actment</w>": 44807,
    "acton": 36167,
    "acton</w>": 36697,
    "actonclimate</w>": 43797,
    "actor": 12181,
    "actor</w>": 4035,
    "actors</w>": 9255,
    "actorslife</w>": 25117,
    "actorvijay</w>": 34033,
    "actress</w>": 5805,
    "actresses</w>": 33639,
    "acts</w>": 6816,
    "actu": 2375,
    "actual</w>": 7488,
    "actually</w>": 2955,
    "acu": 9204,
    "acu</w>": 48475,
    "aculture</w>": 38145,
    "acup": 30869,
    "acup</w>": 27278,
    "acupuncture</w>": 40043,
    "acur": 44719,
    "acura</w>": 30120,
    "acus</w>": 33710,
    "acute</w>": 19734,
    "acy": 18717,
    "acy</w>": 2356,
    "ad": 594,
    "ad</w>": 680,
    "ada": 25785,
    "ada</w>": 1886,
    "adaily</w>": 47254,
    "adal": 46646,
    "adam": 6037,
    "adam</w>": 4944,
    "adamlambert</w>": 27659,
    "adams</w>": 7942,
    "adan</w>": 41802,
    "adani</w>": 37499,
    "adap": 6341,
    "adapt</w>": 22666,
    "adaptation</w>": 16566,
    "adapted</w>": 26657,
    "adapter</w>": 21839,
    "adapting</w>": 44120,
    "adaptive</w>": 28672,
    "adar": 27702,
    "adar</w>": 32681,
    "adas</w>": 23250,
    "adata</w>": 39500,
    "aday": 31367,
    "aday</w>": 10280,
    "adays</w>": 24337,
    "adb</w>": 45630,
    "adc</w>": 38201,
    "add": 19408,
    "add</w>": 3536,
    "addams</w>": 38912,
    "added</w>": 4149,
    "adder</w>": 47557,
    "addi</w>": 36378,
    "addic": 5709,
    "addict</w>": 14614,
    "addicted</w>": 16275,
    "addiction</w>": 11751,
    "addictive</w>": 29638,
    "addicts</w>": 29997,
    "adding</w>": 8676,
    "addis</w>": 43911,
    "addison</w>": 32369,
    "additi": 26927,
    "addition</w>": 6698,
    "additional</w>": 10666,
    "additions</w>": 22575,
    "additive</w>": 48546,
    "addo</w>": 40001,
    "address</w>": 5834,
    "addressed</w>": 20817,
    "addresses</w>": 12702,
    "addressing</w>": 10594,
    "adds</w>": 9944,
    "addy</w>": 24746,
    "ade": 2194,
    "ade</w>": 1928,
    "adecides</w>": 46374,
    "aded</w>": 9994,
    "adee</w>": 47054,
    "adel": 4434,
    "adel</w>": 27308,
    "adelaide": 38193,
    "adelaide</w>": 11611,
    "adele": 42843,
    "adele</w>": 21220,
    "adelrey</w>": 43627,
    "ademy</w>": 49123,
    "aden": 28669,
    "aden</w>": 28688,
    "adena</w>": 23648,
    "adequ": 18232,
    "adequate</w>": 22281,
    "ader</w>": 21365,
    "adero</w>": 49185,
    "aders</w>": 27672,
    "ades</w>": 5793,
    "adh</w>": 42301,
    "adhd</w>": 32649,
    "adhe": 21175,
    "adhesive</w>": 38429,
    "adi": 2486,
    "adi</w>": 8779,
    "adia</w>": 26874,
    "adic</w>": 36780,
    "adid": 8086,
    "adidas": 22396,
    "adidas</w>": 9589,
    "adidasoriginals</w>": 48575,
    "adies</w>": 45834,
    "adifference</w>": 37217,
    "adilla</w>": 41167,
    "ading</w>": 15000,
    "adio</w>": 15060,
    "adirond": 36843,
    "adish</w>": 49009,
    "adity": 28596,
    "aditya</w>": 37186,
    "adityanath</w>": 44437,
    "adjac": 32517,
    "adjacent</w>": 33836,
    "adjec": 45512,
    "adju": 16413,
    "adjun": 45995,
    "adjust": 13784,
    "adjust</w>": 28073,
    "adjustable</w>": 20476,
    "adjusted</w>": 30515,
    "adjusting</w>": 41132,
    "adjustment</w>": 36081,
    "adjustments</w>": 36331,
    "adl</w>": 49351,
    "adler</w>": 30222,
    "adm": 9892,
    "adm</w>": 33604,
    "admi": 11666,
    "admin</w>": 12528,
    "admini": 6434,
    "administr": 12174,
    "administration</w>": 9502,
    "administrative</w>": 22424,
    "administrator</w>": 22603,
    "administrators</w>": 36123,
    "admins</w>": 49297,
    "admir": 17031,
    "admiral</w>": 21013,
    "admiration</w>": 39569,
    "admire</w>": 17791,
    "admired</w>": 36103,
    "admirer</w>": 48344,
    "admiring</w>": 29835,
    "admission</w>": 11315,
    "admissions</w>": 22463,
    "admit</w>": 13769,
    "admits</w>": 16332,
    "admitted</w>": 20427,
    "admitting</w>": 46148,
    "adn</w>": 40339,
    "adnan</w>": 42037,
    "ado": 4775,
    "ado</w>": 2933,
    "adobe": 29256,
    "adobe</w>": 16484,
    "adog</w>": 44913,
    "adol": 33512,
    "adole": 22704,
    "adolescent</w>": 36793,
    "adolescents</w>": 45656,
    "adolf</w>": 41179,
    "adon": 25907,
    "adona</w>": 48419,
    "adop": 4183,
    "adopt": 16441,
    "adopt</w>": 11159,
    "adoptable</w>": 36905,
    "adoptdont": 19674,
    "adoptdontshop</w>": 20089,
    "adopted</w>": 12538,
    "adopting</w>": 30158,
    "adoption</w>": 11544,
    "adopts</w>": 40853,
    "ador": 4992,
    "ador</w>": 9162,
    "adora</w>": 40031,
    "adorable</w>": 6298,
    "adoration</w>": 46781,
    "adore</w>": 15502,
    "adored</w>": 49233,
    "adores</w>": 30290,
    "adorned</w>": 44953,
    "ados</w>": 20079,
    "adox</w>": 32188,
    "adp</w>": 44426,
    "adr</w>": 46189,
    "adren": 24204,
    "adrenaline</w>": 35552,
    "adri": 5935,
    "adrian": 25012,
    "adrian</w>": 13163,
    "adriana</w>": 41363,
    "adrid</w>": 26562,
    "adrien</w>": 47469,
    "adrienne</w>": 40081,
    "ads</w>": 2485,
    "adu": 16882,
    "adu</w>": 24446,
    "adukone</w>": 30511,
    "adul": 7222,
    "adult": 42209,
    "adult</w>": 7115,
    "adulthood</w>": 40964,
    "adults</w>": 9391,
    "adv": 1647,
    "adv</w>": 21018,
    "advan": 33411,
    "advance": 27291,
    "advance</w>": 7022,
    "advanced</w>": 7465,
    "advancement</w>": 35437,
    "advances</w>": 15852,
    "advancing</w>": 21355,
    "advani</w>": 48189,
    "advant": 7017,
    "advantage</w>": 8573,
    "advantaged</w>": 38361,
    "advantages</w>": 23506,
    "adven": 41670,
    "advent": 3071,
    "advent</w>": 15199,
    "adventcalendar</w>": 43492,
    "adventur": 29627,
    "adventure": 17251,
    "adventure</w>": 4377,
    "adventurer</w>": 48098,
    "adventures</w>": 7941,
    "adventurous</w>": 31179,
    "adver": 4806,
    "adverse</w>": 30348,
    "adversity</w>": 32516,
    "advert</w>": 19080,
    "adverti": 5682,
    "advertise</w>": 31473,
    "advertised</w>": 38987,
    "advertisement</w>": 18713,
    "advertiser</w>": 41829,
    "advertisers</w>": 45472,
    "advertising</w>": 8158,
    "adverts</w>": 44306,
    "advice</w>": 4973,
    "advis": 4634,
    "advise</w>": 25962,
    "advised</w>": 23196,
    "adviser</w>": 20367,
    "advisers</w>": 40984,
    "advises</w>": 42761,
    "advising</w>": 39648,
    "advisor</w>": 12380,
    "advisors</w>": 23197,
    "advisory</w>": 10224,
    "advoc": 6657,
    "advocacy</w>": 14443,
    "advocate</w>": 12044,
    "advocates</w>": 17757,
    "adwords</w>": 48343,
    "ady": 41446,
    "ady</w>": 8781,
    "ae": 5548,
    "ae</w>": 4542,
    "aea</w>": 37048,
    "aed</w>": 26912,
    "aege": 42304,
    "ael": 41533,
    "ael</w>": 43340,
    "aen": 43085,
    "aer": 10195,
    "aeri": 27685,
    "aerial": 44866,
    "aerial</w>": 12440,
    "aero": 10196,
    "aero</w>": 25026,
    "aerob": 42824,
    "aeron": 37286,
    "aeronau": 42816,
    "aerop": 27735,
    "aerosmith</w>": 43253,
    "aerospace</w>": 20530,
    "aes": 10617,
    "aes</w>": 35677,
    "aest</w>": 40694,
    "aesthe": 21181,
    "aesthetic</w>": 16179,
    "aesthetics</w>": 29295,
    "aew</w>": 47108,
    "af": 702,
    "af</w>": 4391,
    "afa</w>": 24953,
    "afan": 47474,
    "afar": 41637,
    "afar</w>": 37866,
    "afb</w>": 27022,
    "afc": 29742,
    "afc</w>": 6571,
    "afcb</w>": 44276,
    "afcon</w>": 30019,
    "afd</w>": 44626,
    "afe": 30487,
    "afe</w>": 13912,
    "afer": 44707,
    "aff": 8849,
    "aff</w>": 14864,
    "affair</w>": 13998,
    "affairs</w>": 9830,
    "affe": 4556,
    "affect</w>": 11361,
    "affected</w>": 9715,
    "affecting</w>": 18448,
    "affection": 33780,
    "affection</w>": 28381,
    "affectionate</w>": 42578,
    "affects</w>": 17285,
    "affili": 12120,
    "affiliate</w>": 18652,
    "affiliated</w>": 37540,
    "affiliation</w>": 48377,
    "affinity</w>": 41451,
    "affir": 25343,
    "affirm": 42711,
    "affirm</w>": 48625,
    "affirmation</w>": 47495,
    "affl": 34036,
    "affleck</w>": 35584,
    "afford": 7951,
    "afford</w>": 13223,
    "affordability</w>": 44828,
    "affordable": 43944,
    "affordable</w>": 8926,
    "afg</w>": 33994,
    "afgh": 9029,
    "afghan</w>": 15919,
    "afghanistan</w>": 9836,
    "afi": 24074,
    "afi</w>": 31958,
    "afil": 27209,
    "afire</w>": 42010,
    "afirst</w>": 38601,
    "afl": 15132,
    "afl</w>": 14356,
    "aflo": 41959,
    "afm</w>": 38385,
    "afootball</w>": 41694,
    "afor": 43102,
    "afore": 41468,
    "afp</w>": 18311,
    "afraid</w>": 9474,
    "afri": 13888,
    "afric": 2136,
    "africa</w>": 3093,
    "african": 17471,
    "african</w>": 4736,
    "africans</w>": 26534,
    "afridi</w>": 37651,
    "afrika</w>": 45833,
    "afrin</w>": 45586,
    "afro": 16267,
    "afro</w>": 21795,
    "afs</w>": 48960,
    "aft</w>": 22693,
    "after": 2278,
    "after</w>": 953,
    "afterdark</w>": 48966,
    "afterlife</w>": 46790,
    "aftermath</w>": 20958,
    "afterno": 22330,
    "afternoon": 39035,
    "afternoon</w>": 2716,
    "afternoons</w>": 31631,
    "afterparty</w>": 35305,
    "afterwards</w>": 23911,
    "ag": 602,
    "ag</w>": 5241,
    "aga": 1050,
    "aga</w>": 4654,
    "again</w>": 1495,
    "against": 23838,
    "against</w>": 1601,
    "agame</w>": 46943,
    "agan": 42946,
    "agan</w>": 9178,
    "agar": 13199,
    "agar</w>": 17544,
    "agarwal</w>": 43117,
    "agas": 20430,
    "agate</w>": 25454,
    "agatha</w>": 43896,
    "agave</w>": 42671,
    "agawa</w>": 39433,
    "agazine</w>": 44942,
    "age": 4758,
    "age</w>": 805,
    "aged</w>": 3889,
    "ageing</w>": 25349,
    "agen": 10101,
    "agen</w>": 43696,
    "agencies</w>": 13887,
    "agency": 44885,
    "agency</w>": 6270,
    "agend": 48653,
    "agenda</w>": 8728,
    "agent": 21210,
    "agent</w>": 6576,
    "agents</w>": 10199,
    "agentsof": 37074,
    "agentsofshield</w>": 38801,
    "ager": 44847,
    "ager</w>": 10443,
    "agers</w>": 22123,
    "ages</w>": 2321,
    "agg</w>": 45482,
    "aggarwal</w>": 39386,
    "agger": 27836,
    "aggi": 36844,
    "aggie": 44244,
    "aggie</w>": 37618,
    "aggies</w>": 31047,
    "aggio</w>": 36685,
    "aggrav": 35203,
    "aggre": 10426,
    "aggreg": 41968,
    "aggregate</w>": 41318,
    "aggression</w>": 28900,
    "aggressive</w>": 16295,
    "aggressively</w>": 48667,
    "agh": 17917,
    "agh</w>": 14402,
    "aghan</w>": 31276,
    "agi": 24036,
    "agi</w>": 17645,
    "agic</w>": 37652,
    "agile</w>": 16276,
    "agility</w>": 32161,
    "aging</w>": 4336,
    "agio</w>": 41746,
    "agirl</w>": 35469,
    "agle": 37035,
    "agle</w>": 16702,
    "agles": 36374,
    "agles</w>": 22679,
    "aglia</w>": 46912,
    "agm</w>": 19162,
    "agn": 36474,
    "agna</w>": 43626,
    "agne": 29374,
    "agne</w>": 48303,
    "agnes</w>": 26213,
    "agno": 41540,
    "ago": 6276,
    "ago</w>": 1468,
    "agomez</w>": 27127,
    "agon": 26775,
    "agon</w>": 14901,
    "agony</w>": 36977,
    "agor": 38920,
    "agos</w>": 32657,
    "agov</w>": 34227,
    "agp</w>": 46048,
    "agr": 36639,
    "agra": 26660,
    "agra</w>": 29830,
    "agram</w>": 2447,
    "agre": 3180,
    "agreat": 37594,
    "agree</w>": 5953,
    "agreed</w>": 12774,
    "agreeing</w>": 40720,
    "agreement</w>": 8286,
    "agreements</w>": 25865,
    "agrees</w>": 17854,
    "agri": 20527,
    "agri</w>": 30326,
    "agricul": 7234,
    "agricultural</w>": 15440,
    "agriculture</w>": 9720,
    "agro": 33178,
    "agro</w>": 44589,
    "agron": 41314,
    "agroup</w>": 40099,
    "ags</w>": 16926,
    "agt</w>": 39681,
    "agu": 3922,
    "agu</w>": 36544,
    "agua</w>": 18482,
    "aguchi</w>": 49206,
    "ague</w>": 2095,
    "aguero</w>": 42964,
    "agues</w>": 7000,
    "aguil": 27946,
    "aguilar</w>": 44715,
    "ah": 1772,
    "ah</w>": 1288,
    "aha": 12082,
    "aha</w>": 8429,
    "ahah</w>": 38661,
    "ahaha</w>": 32423,
    "ahahaha</w>": 42620,
    "aham": 36036,
    "ahan": 45061,
    "ahan</w>": 19255,
    "ahar": 31038,
    "ahar</w>": 38760,
    "ahe": 27688,
    "ahead</w>": 3158,
    "ahem</w>": 39995,
    "ahh</w>": 13152,
    "ahhh</w>": 14769,
    "ahhhh</w>": 21054,
    "ahhhhh</w>": 36392,
    "ahi": 45349,
    "ahi</w>": 24154,
    "ahl</w>": 30433,
    "ahmad": 32167,
    "ahmad</w>": 16902,
    "ahmadi": 38656,
    "ahmadiyya</w>": 44865,
    "ahmed": 19491,
    "ahmed</w>": 12081,
    "ahmedabad</w>": 26966,
    "ahn</w>": 33405,
    "aho": 28114,
    "aho</w>": 38444,
    "ahora</w>": 43113,
    "ahouse</w>": 33197,
    "ahoy</w>": 38652,
    "ahs</w>": 16937,
    "ahu": 11908,
    "ahu</w>": 16515,
    "ai": 2014,
    "ai</w>": 2215,
    "aia</w>": 27046,
    "aib</w>": 34780,
    "aic": 29454,
    "aid": 13723,
    "aid</w>": 5182,
    "aida</w>": 33830,
    "aidan": 48814,
    "aidan</w>": 26945,
    "aide": 31558,
    "aide</w>": 9746,
    "aided</w>": 48707,
    "aiden</w>": 40020,
    "aides</w>": 49082,
    "aids</w>": 11759,
    "aig": 27295,
    "aig</w>": 46989,
    "aii</w>": 22478,
    "aik</w>": 42575,
    "aiken</w>": 46342,
    "ail": 1457,
    "ail</w>": 9154,
    "ailed</w>": 38919,
    "ailing</w>": 29999,
    "ails</w>": 27024,
    "aim": 6787,
    "aim</w>": 11255,
    "aime</w>": 39872,
    "aimed</w>": 20247,
    "aimee</w>": 36318,
    "aiming</w>": 21768,
    "aimo</w>": 36706,
    "aims</w>": 13326,
    "ain": 8326,
    "ain</w>": 2210,
    "aine": 48983,
    "aine</w>": 17634,
    "ains</w>": 27621,
    "aint": 29543,
    "aint</w>": 13099,
    "ainted</w>": 39933,
    "aioli</w>": 43949,
    "air": 1281,
    "air</w>": 1922,
    "aira": 35085,
    "aira</w>": 46444,
    "airasia</w>": 48020,
    "airbnb</w>": 23098,
    "airborne</w>": 22755,
    "airbus</w>": 15324,
    "aircraft</w>": 7706,
    "airdrop</w>": 38434,
    "aire</w>": 7682,
    "aired</w>": 21938,
    "aires</w>": 17034,
    "airfield</w>": 40525,
    "airforce</w>": 23511,
    "airing</w>": 20453,
    "airline</w>": 14847,
    "airlines</w>": 8929,
    "airmen</w>": 44499,
    "airplane</w>": 16451,
    "airplanes</w>": 33319,
    "airplay</w>": 47024,
    "airpollution</w>": 47362,
    "airport": 48337,
    "airport</w>": 3259,
    "airports</w>": 21543,
    "airs</w>": 18539,
    "airshow</w>": 27139,
    "airsoft</w>": 30134,
    "airspace</w>": 49280,
    "airstrikes</w>": 37220,
    "airtel</w>": 34784,
    "airtime</w>": 46617,
    "airwaves</w>": 43910,
    "airways</w>": 14299,
    "airy</w>": 44453,
    "ais": 7616,
    "ais</w>": 11393,
    "aise</w>": 30505,
    "aish": 21946,
    "aisha</w>": 40211,
    "aishwar": 29687,
    "aishwarya</w>": 44019,
    "aisle</w>": 26917,
    "ait": 25613,
    "ait</w>": 40814,
    "aj": 3990,
    "aj</w>": 6342,
    "aja": 42343,
    "aja</w>": 19633,
    "ajax</w>": 21933,
    "ajay": 22494,
    "ajay</w>": 28726,
    "ajaydevgn</w>": 35515,
    "aje": 48818,
    "aje</w>": 33315,
    "ajes</w>": 38791,
    "aji": 26102,
    "aji</w>": 21153,
    "ajit</w>": 42261,
    "ajith</w>": 24118,
    "ajo</w>": 26958,
    "aju": 36855,
    "ak": 819,
    "ak</w>": 1196,
    "aka": 19154,
    "aka</w>": 3412,
    "akaif</w>": 45736,
    "akan": 43678,
    "akan</w>": 38244,
    "akapoor</w>": 40064,
    "akarta</w>": 48603,
    "akb</w>": 41962,
    "akbar</w>": 27180,
    "ake": 10558,
    "ake</w>": 5776,
    "aked</w>": 6115,
    "aker": 14245,
    "aker</w>": 3074,
    "akers</w>": 5788,
    "akes</w>": 4764,
    "akest</w>": 46679,
    "akh": 14821,
    "akh</w>": 30660,
    "akhan</w>": 28158,
    "akhi": 41660,
    "akhilesh</w>": 48495,
    "akhtar</w>": 45458,
    "aki": 18173,
    "aki</w>": 6592,
    "akin": 24630,
    "akin</w>": 13601,
    "aking</w>": 1809,
    "akins</w>": 48568,
    "akira</w>": 34001,
    "akis</w>": 27732,
    "akistan</w>": 46221,
    "akley</w>": 39908,
    "ako": 44027,
    "ako</w>": 14541,
    "akon</w>": 47105,
    "akos</w>": 44659,
    "akrish": 37434,
    "akron</w>": 26115,
    "aks</w>": 2953,
    "aksh": 28226,
    "akshay": 21483,
    "akshay</w>": 38914,
    "akshaykumar</w>": 23624,
    "akshi</w>": 42634,
    "aku": 18151,
    "aku</w>": 20815,
    "aky</w>": 11977,
    "al": 526,
    "al</w>": 566,
    "ala": 12783,
    "ala</w>": 3449,
    "alab": 6365,
    "alabam": 45880,
    "alabama</w>": 8422,
    "alach": 24622,
    "alad": 23074,
    "aladdin</w>": 29951,
    "alai</w>": 47072,
    "alain</w>": 28999,
    "alam": 16612,
    "alam</w>": 16012,
    "alamo": 41922,
    "alamo</w>": 34632,
    "alan": 9563,
    "alan</w>": 5773,
    "alana</w>": 43405,
    "aland": 34304,
    "aland</w>": 6819,
    "alar": 34333,
    "alarm</w>": 11321,
    "alarming</w>": 37209,
    "alarms</w>": 31236,
    "alarts</w>": 31422,
    "alas": 7276,
    "alas</w>": 22412,
    "alaska</w>": 9562,
    "alaskan</w>": 33898,
    "alastair</w>": 42062,
    "alay": 30289,
    "alay</w>": 36450,
    "alaya</w>": 36397,
    "alb": 45248,
    "alba</w>": 25254,
    "alban": 10882,
    "albania</w>": 29170,
    "albanian</w>": 47721,
    "albans</w>": 44119,
    "albany</w>": 17359,
    "albat": 42797,
    "albeit</w>": 38984,
    "alber": 6413,
    "albert": 34174,
    "albert</w>": 9507,
    "alberta</w>": 11048,
    "alberto</w>": 22714,
    "albi": 18512,
    "albino</w>": 48062,
    "albion</w>": 24071,
    "albu": 2216,
    "album": 40712,
    "album</w>": 2431,
    "albums</w>": 10705,
    "albuquerque</w>": 31079,
    "alcat": 35361,
    "alche": 37909,
    "alchemist</w>": 38913,
    "alchemy</w>": 39501,
    "alco": 6848,
    "alco</w>": 45446,
    "alcohol</w>": 9426,
    "alcoholic</w>": 25098,
    "ald": 4539,
    "ald</w>": 2928,
    "alda</w>": 46440,
    "alde": 33114,
    "alden": 17155,
    "alden</w>": 27710,
    "aldenrichards</w>": 20051,
    "alder": 18220,
    "alder</w>": 46571,
    "aldi</w>": 23204,
    "aldo</w>": 9933,
    "aldridge</w>": 38084,
    "alds</w>": 14285,
    "aldu": 6505,
    "aldub": 10532,
    "aldub</w>": 15247,
    "ale": 1440,
    "ale</w>": 1336,
    "alea</w>": 26518,
    "aleague</w>": 38909,
    "alec": 29804,
    "alec</w>": 19954,
    "alecoscino</w>": 47948,
    "aled</w>": 4970,
    "alee</w>": 24515,
    "alej": 23440,
    "alejandro</w>": 32950,
    "alek": 26906,
    "alek</w>": 43310,
    "aleksand": 48429,
    "alem</w>": 11825,
    "aleppo</w>": 19258,
    "aler": 25674,
    "aler</w>": 27335,
    "alert</w>": 4662,
    "alerts</w>": 22144,
    "ales": 44171,
    "ales</w>": 5962,
    "aless": 21864,
    "alessandro</w>": 37344,
    "alestine</w>": 31945,
    "alex": 2959,
    "alex</w>": 4134,
    "alexa</w>": 16273,
    "alexand": 10696,
    "alexander": 25527,
    "alexander</w>": 7563,
    "alexandra</w>": 19054,
    "alexandre</w>": 35711,
    "alexandria</w>": 21171,
    "alexis": 35023,
    "alexis</w>": 14243,
    "aley</w>": 21635,
    "alf</w>": 27098,
    "alfa</w>": 23482,
    "alfar": 38870,
    "alfie</w>": 28598,
    "alfon": 31947,
    "alfonso</w>": 41784,
    "alfre": 20982,
    "alfred</w>": 16553,
    "alfredo</w>": 32291,
    "algae</w>": 25654,
    "algar": 36291,
    "algarve</w>": 40290,
    "alge": 24336,
    "algebra</w>": 33694,
    "alger": 18568,
    "algeria</w>": 25257,
    "algon": 33007,
    "algori": 14912,
    "algorithm</w>": 23295,
    "algorithms</w>": 26039,
    "alham": 23352,
    "alhamdulil": 35129,
    "alhamdulillah</w>": 38982,
    "ali": 835,
    "ali</w>": 3558,
    "alia</w>": 2492,
    "aliaa</w>": 36468,
    "alian</w>": 3464,
    "alias</w>": 40026,
    "alibaba</w>": 39231,
    "alic": 25265,
    "alice": 23759,
    "alice</w>": 9192,
    "alici": 31630,
    "alicia</w>": 20914,
    "alie</w>": 8697,
    "alien": 22846,
    "alien</w>": 9639,
    "aliens</w>": 14883,
    "alier</w>": 39493,
    "alies</w>": 38086,
    "alife": 41347,
    "alife</w>": 21100,
    "alig": 21272,
    "alight</w>": 36157,
    "align</w>": 31160,
    "aligned</w>": 29292,
    "alignment</w>": 27267,
    "alik</w>": 31141,
    "alike</w>": 12665,
    "alim": 42075,
    "alin": 42746,
    "alin</w>": 40063,
    "alina</w>": 39529,
    "aline</w>": 21799,
    "aling</w>": 5169,
    "alion</w>": 19049,
    "alis": 21308,
    "alis</w>": 20114,
    "alisa</w>": 38918,
    "alisation</w>": 42143,
    "alise</w>": 36718,
    "alised</w>": 25099,
    "alism</w>": 5607,
    "alison": 28653,
    "alison</w>": 16970,
    "alist": 44900,
    "alist</w>": 3320,
    "alistair</w>": 40551,
    "alistic</w>": 22302,
    "alists</w>": 5653,
    "alit": 45566,
    "alities</w>": 27925,
    "ality</w>": 1694,
    "alive": 40467,
    "alive</w>": 4716,
    "aliz": 30979,
    "alization</w>": 8026,
    "alize</w>": 10268,
    "alized</w>": 6141,
    "alizer</w>": 38922,
    "alizes</w>": 26181,
    "alizing</w>": 13023,
    "alk": 30246,
    "alk</w>": 21577,
    "alkal": 33450,
    "alkaline</w>": 39210,
    "all": 813,
    "all</w>": 615,
    "alla": 13884,
    "alla</w>": 14000,
    "allabout": 43996,
    "allah</w>": 6378,
    "allan": 36552,
    "allan</w>": 15404,
    "allblacks</w>": 47728,
    "allday</w>": 35862,
    "alle": 4870,
    "alle</w>": 29478,
    "alled</w>": 7379,
    "alleg": 7456,
    "allegations</w>": 16992,
    "alleged</w>": 12133,
    "allegedly</w>": 14177,
    "alleges</w>": 45051,
    "allegh": 41479,
    "allegheny</w>": 47851,
    "allegi": 28832,
    "allegiance</w>": 30955,
    "allen": 16712,
    "allen</w>": 6386,
    "allenge</w>": 31387,
    "aller": 10116,
    "aller</w>": 30630,
    "allergic</w>": 28809,
    "allergies</w>": 28247,
    "allergy</w>": 24408,
    "allery</w>": 32542,
    "alles</w>": 43354,
    "allevi": 31682,
    "alleviate</w>": 44799,
    "alley": 36205,
    "alley</w>": 10329,
    "allez</w>": 49137,
    "alli": 4123,
    "alli</w>": 15268,
    "alliance": 45404,
    "alliance</w>": 8945,
    "alliances</w>": 48403,
    "allianz</w>": 45740,
    "allie</w>": 25040,
    "allied</w>": 20045,
    "allies</w>": 17277,
    "alligator</w>": 28574,
    "allin": 45007,
    "allin</w>": 22395,
    "alline</w>": 48182,
    "alling</w>": 2992,
    "allis</w>": 45309,
    "allison": 34602,
    "allison</w>": 16578,
    "allman</w>": 42611,
    "allo": 8107,
    "allo</w>": 18389,
    "allocated</w>": 42716,
    "allocation</w>": 35139,
    "allon</w>": 46693,
    "allot": 26363,
    "allotment</w>": 33750,
    "allow": 5645,
    "allow</w>": 6722,
    "allowance</w>": 35696,
    "allowed</w>": 7885,
    "allowing</w>": 12458,
    "allows</w>": 9966,
    "alloy</w>": 22467,
    "alls</w>": 1997,
    "allstar": 31247,
    "allstar</w>": 22974,
    "allstars</w>": 31198,
    "allthe": 29253,
    "allu": 20157,
    "alluarjun</w>": 39333,
    "allure</w>": 41814,
    "ally": 7461,
    "ally</w>": 769,
    "alm</w>": 28303,
    "alma": 32933,
    "alma</w>": 18337,
    "alman": 29394,
    "almanac</w>": 41268,
    "almighty</w>": 21898,
    "almond</w>": 15646,
    "almonds</w>": 30468,
    "almost": 47534,
    "almost</w>": 2671,
    "aln": 47203,
    "alo": 3435,
    "alo</w>": 6183,
    "aloe</w>": 30728,
    "alog</w>": 15813,
    "alogue</w>": 9101,
    "aloha</w>": 23160,
    "aloils</w>": 49002,
    "alom</w>": 22236,
    "alon": 14097,
    "alon</w>": 42846,
    "alone</w>": 4702,
    "along": 8300,
    "along</w>": 2528,
    "alongside</w>": 8646,
    "alonso</w>": 25704,
    "aloo</w>": 46187,
    "alore</w>": 14323,
    "alot</w>": 16945,
    "alou": 43180,
    "aloud</w>": 30028,
    "alove": 46669,
    "alove</w>": 37045,
    "alp": 32020,
    "alp</w>": 39342,
    "alpac": 30128,
    "alpaca</w>": 42561,
    "alph": 6720,
    "alpha": 11807,
    "alpha</w>": 8624,
    "alphabe": 45796,
    "alphabet</w>": 22335,
    "alphon": 37865,
    "alpine</w>": 17055,
    "alps</w>": 18191,
    "already</w>": 2426,
    "alright</w>": 10866,
    "als": 23982,
    "als</w>": 938,
    "alsace</w>": 49388,
    "also</w>": 1446,
    "alt": 9995,
    "alt</w>": 10006,
    "alta": 24470,
    "alta</w>": 25378,
    "altaf</w>": 47342,
    "altam": 45624,
    "altar</w>": 16385,
    "alter": 4949,
    "alter</w>": 21393,
    "altered</w>": 25201,
    "altern": 47463,
    "alternate</w>": 15926,
    "alternati": 16699,
    "alternative": 37327,
    "alternative</w>": 8248,
    "alternatives</w>": 25041,
    "alth": 23463,
    "alth</w>": 5863,
    "although</w>": 9421,
    "alti": 35531,
    "alties</w>": 17276,
    "altitude</w>": 23241,
    "altman</w>": 48100,
    "alto": 35053,
    "alto</w>": 17518,
    "altogether</w>": 45689,
    "alton": 41331,
    "alton</w>": 36550,
    "altrin": 38458,
    "altrincham</w>": 44718,
    "alty</w>": 5546,
    "alu": 4776,
    "alu</w>": 27991,
    "alum": 5404,
    "alum</w>": 10553,
    "alumin": 14563,
    "alumini": 22908,
    "aluminium</w>": 23631,
    "aluminum</w>": 15251,
    "alumna</w>": 30313,
    "alumni</w>": 6646,
    "alumnus</w>": 23633,
    "alums</w>": 30155,
    "alv": 20928,
    "alvar": 25196,
    "alvarez</w>": 26924,
    "alvaro</w>": 41941,
    "alves</w>": 38547,
    "alvin</w>": 27023,
    "alway": 14046,
    "alway</w>": 43764,
    "always": 24997,
    "always</w>": 1466,
    "alwx</w>": 32768,
    "aly": 6468,
    "aly</w>": 12910,
    "alyn": 49150,
    "alyss": 29490,
    "alyssa</w>": 18898,
    "alz": 12936,
    "alz</w>": 41128,
    "alzheim": 15212,
    "alzheimer</w>": 21151,
    "alzheimers</w>": 34592,
    "am": 548,
    "am</w>": 687,
    "ama": 18206,
    "ama</w>": 1696,
    "amad": 45095,
    "amade": 37366,
    "amag": 32049,
    "amal": 15315,
    "amal</w>": 36753,
    "aman": 19890,
    "aman</w>": 10110,
    "amand": 14560,
    "amanda</w>": 10036,
    "amar": 6424,
    "amar</w>": 19607,
    "amara</w>": 48522,
    "amari": 42565,
    "amarillo</w>": 40449,
    "amarine</w>": 45591,
    "amarketing</w>": 30788,
    "amas": 22716,
    "amas</w>": 15667,
    "amat": 38664,
    "amat</w>": 25455,
    "amate": 12453,
    "amateur</w>": 14287,
    "amaya</w>": 47210,
    "amaz": 1185,
    "amaze</w>": 24846,
    "amazed</w>": 18944,
    "amazing": 15949,
    "amazing</w>": 1370,
    "amazingly</w>": 20368,
    "amazon": 13630,
    "amazon</w>": 4140,
    "amb": 9042,
    "amb</w>": 16853,
    "amba</w>": 27003,
    "ambani</w>": 45967,
    "ambas": 5634,
    "ambassad": 5758,
    "ambassador</w>": 6795,
    "ambassadors</w>": 16832,
    "ambed": 42089,
    "ambedkar</w>": 48131,
    "amber": 18292,
    "amber</w>": 9986,
    "ambi": 11844,
    "ambient</w>": 23447,
    "ambigu": 35702,
    "ambition</w>": 20673,
    "ambitions</w>": 34152,
    "ambitious</w>": 18666,
    "ambro": 17585,
    "ambrose</w>": 24253,
    "ambu": 34423,
    "ambul": 13944,
    "ambulance</w>": 15555,
    "ambush</w>": 40725,
    "amc": 24942,
    "amc</w>": 16921,
    "amd</w>": 20845,
    "ame": 3995,
    "ame</w>": 780,
    "amed</w>": 5660,
    "ameen</w>": 24229,
    "amel": 31988,
    "amel</w>": 10960,
    "ameli": 21599,
    "amelia</w>": 21433,
    "amell</w>": 48198,
    "amen": 18716,
    "amen</w>": 12335,
    "amend": 12425,
    "amendment</w>": 15019,
    "amendments</w>": 40901,
    "amenities</w>": 30096,
    "ament</w>": 27528,
    "amer": 17081,
    "amer</w>": 16147,
    "ameri": 40422,
    "americ": 1283,
    "america</w>": 2224,
    "americafirst</w>": 43216,
    "american": 8746,
    "american</w>": 2151,
    "americana</w>": 26221,
    "americanair</w>": 42538,
    "americani": 39726,
